Revit 2024 API
FamilySizeTableManager.NumberOfSizeTables Property
 The number of FamilySizeTables in a family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int NumberOfSizeTables { get; }
Visual Basic
Public ReadOnly Property NumberOfSizeTables As Integer
	Get
Visual C++
public:
property int NumberOfSizeTables {
	int get ();
}
See Also
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace